tutorials/modules/incompressibleFluid/waveSubSurface/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type            noSlip;
    }
    "(top|inlet)"
    {
        type            waveVelocity;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    "(front|back)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
