tutorials/modules/incompressibleFluid/waveSubSurface/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setWaves
runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar -newTimes
